ghix-tools/test/GHIX_UI_Automation_Tests/resources/payloads/NJ/templates/HH1_template.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsse:Security soap:mustUnderstand="true" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-84816E57F38B10764D16032967208211">
                <wsse:Username>AT_USERNAME</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">AT_PASSWORD_DIGEST</wsse:Password>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">AT_NONCE</wsse:Nonce>
                <wsu:Created>AT_CREATED</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <ns9:AccountTransferRequest xmlns:ns1="http://niem.gov/niem/structures/2.0" xmlns:ns10="http://niem.gov/niem/appinfo/2.1" xmlns:ns2="http://niem.gov/niem/niem-core/2.0" xmlns:ns3="http://at.dsh.cms.gov/extension/1.0" xmlns:ns4="http://hix.cms.gov/0.1/hix-core" xmlns:ns5="http://hix.cms.gov/0.1/hix-ee" xmlns:ns6="http://niem.gov/niem/domains/screening/2.1" xmlns:ns7="http://hix.cms.gov/0.1/hix-pm" xmlns:ns8="http://niem.gov/niem/appinfo/2.0" xmlns:ns9="http://at.dsh.cms.gov/exchange/1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ns3:atVersionText="2.4" xsi:schemaLocation="http://at.dsh.cms.gov/extension/1.0">
            <ns3:TransferHeader>
                <ns3:TransferActivity>
                    <ns2:ActivityIdentification>
                        <ns2:IdentificationID>REMOTE_ID</ns2:IdentificationID>
                    </ns2:ActivityIdentification>
                    <ns2:ActivityDate>
                        <ns2:DateTime>CURRENT_DATE_UTCZ</ns2:DateTime>
                    </ns2:ActivityDate>
                    <ns3:TransferActivityReferralQuantity>1</ns3:TransferActivityReferralQuantity>
                    <ns3:RecipientTransferActivityCode>Exchange</ns3:RecipientTransferActivityCode>
                    <ns3:RecipientTransferActivityStateCode>NJ</ns3:RecipientTransferActivityStateCode>
                </ns3:TransferActivity>
            </ns3:TransferHeader>
            <ns4:Sender ns1:id="Sender">
                <ns4:InformationExchangeSystemCategoryCode>MedicaidAgency</ns4:InformationExchangeSystemCategoryCode>
                <ns4:InformationExchangeSystemStateCode>NJ</ns4:InformationExchangeSystemStateCode>
                <ns4:InformationExchangeSystemCountyName>SUSSEX</ns4:InformationExchangeSystemCountyName>
            </ns4:Sender>
            <ns4:Receiver ns1:id="Receiver">
                <ns4:InformationExchangeSystemCategoryCode>Exchange</ns4:InformationExchangeSystemCategoryCode>
            </ns4:Receiver>
            <ns5:InsuranceApplication>
                <ns4:ApplicationCreation>
                    <ns2:ActivityDate>
                        <ns2:DateTime>CURRENT_DATE_UTCZ</ns2:DateTime>
                    </ns2:ActivityDate>
                </ns4:ApplicationCreation>
                <ns4:ApplicationSubmission>
                    <ns2:ActivityDate>
                        <ns2:DateTime>CURRENT_DATE_UTCZ</ns2:DateTime>
                    </ns2:ActivityDate>
                </ns4:ApplicationSubmission>
                <ns4:ApplicationUpdate>
                    <ns2:ActivityDate>
                        <ns2:DateTime>CURRENT_DATE_UTCZ</ns2:DateTime>
                    </ns2:ActivityDate>
                </ns4:ApplicationUpdate>
                <ns4:ApplicationIdentification>
                    <ns2:IdentificationID>APPLICATION_ID</ns2:IdentificationID>
                </ns4:ApplicationIdentification>
                <ns5:InsuranceApplicant>
                    <ns4:RoleOfPersonReference ns1:ref="M1"/>
                    <ns5:InsuranceApplicantBlindnessOrDisabilityIndicator>false</ns5:InsuranceApplicantBlindnessOrDisabilityIndicator>
                    <ns5:InsuranceApplicantCoverageDuringPreviousSixMonthsIndicator>false</ns5:InsuranceApplicantCoverageDuringPreviousSixMonthsIndicator>
                    <ns5:InsuranceApplicantFixedAddressIndicator>true</ns5:InsuranceApplicantFixedAddressIndicator>
                    <ns5:InsuranceApplicantIncarceration>
                        <ns4:IncarcerationIndicator>false</ns4:IncarcerationIndicator>
                    </ns5:InsuranceApplicantIncarceration>
                    <ns5:InsuranceApplicantLawfulPresenceStatus>
                        <ns5:LawfulPresenceStatusArrivedBefore1996Indicator>true</ns5:LawfulPresenceStatusArrivedBefore1996Indicator>
                        <ns5:LawfulPresenceStatusImmigrationDocument>
                            <ns5:LawfulPresenceDocumentNumber>
                                <ns2:IdentificationID>drp0314000530</ns2:IdentificationID>
                            </ns5:LawfulPresenceDocumentNumber>
                            <ns5:LawfulPresenceDocumentPersonIdentification>
                                <ns2:IdentificationID>310000501</ns2:IdentificationID>
                                <ns2:IdentificationCategoryText>I551</ns2:IdentificationCategoryText>
                            </ns5:LawfulPresenceDocumentPersonIdentification>
                            <ns5:LawfulPresenceDocumentSameNameIndicator>true</ns5:LawfulPresenceDocumentSameNameIndicator>
                            <ns5:LawfulPresenceDocumentCategoryCode>I551</ns5:LawfulPresenceDocumentCategoryCode>
                        </ns5:LawfulPresenceStatusImmigrationDocument>
                        <ns5:LawfulPresenceStatusEligibility>
                            <ns5:EligibilityIndicator>true</ns5:EligibilityIndicator>
                        </ns5:LawfulPresenceStatusEligibility>
                    </ns5:InsuranceApplicantLawfulPresenceStatus>
                    <ns5:InsuranceApplicantLongTermCareIndicator>false</ns5:InsuranceApplicantLongTermCareIndicator>
                    <ns5:InsuranceApplicantNonESICoverageIndicator>false</ns5:InsuranceApplicantNonESICoverageIndicator>
                    <ns5:InsuranceApplicantRecentMedicalBillsIndicator>false</ns5:InsuranceApplicantRecentMedicalBillsIndicator>
                    <ns5:InsuranceApplicantStudentIndicator>false</ns5:InsuranceApplicantStudentIndicator>
                    <ns5:InsuranceApplicantStateBenefitsThroughPublicEmployeeIndicator>false</ns5:InsuranceApplicantStateBenefitsThroughPublicEmployeeIndicator>
                    <ns5:MedicaidMAGIEligibility>
                        <ns5:EligibilityDateRange>
                            <ns2:StartDate xsi:nil="true"/>
                        </ns5:EligibilityDateRange>
                        <ns5:EligibilityDetermination>
                            <ns2:ActivityDate xsi:nil="true"/>
                        </ns5:EligibilityDetermination>
                        <ns5:EligibilityReasonText>143</ns5:EligibilityReasonText>
                        <ns5:EligibilityIndicator>false</ns5:EligibilityIndicator>
                    </ns5:MedicaidMAGIEligibility>
                    <ns5:InsuranceApplicantHadMedicaidDuringFosterCareIndicator>false</ns5:InsuranceApplicantHadMedicaidDuringFosterCareIndicator>
                    <ns5:ReferralActivity>
                        <ns2:ActivityIdentification>
                            <ns2:IdentificationID>R1</ns2:IdentificationID>
                        </ns2:ActivityIdentification>
                        <ns2:ActivityDate>
                            <ns2:DateTime>CURRENT_DATE_UTCZ</ns2:DateTime>
                        </ns2:ActivityDate>
                        <ns5:ReferralActivitySenderReference ns1:ref="Sender"/>
                        <ns5:ReferralActivityReceiverReference ns1:ref="Receiver"/>
                        <ns5:ReferralActivityStatus>
                            <ns5:ReferralActivityStatusCode>Rejected</ns5:ReferralActivityStatusCode>
                        </ns5:ReferralActivityStatus>
                    </ns5:ReferralActivity>
                </ns5:InsuranceApplicant>
                <ns5:InsuranceApplicationRequestingFinancialAssistanceIndicator>true</ns5:InsuranceApplicationRequestingFinancialAssistanceIndicator>
                <ns5:InsuranceApplicationCoverageRenewalYearQuantity>1</ns5:InsuranceApplicationCoverageRenewalYearQuantity>
                <ns5:SSFSigner>
                    <ns4:RoleOfPersonReference ns1:ref="M1"/>
                    <ns5:Signature>
                        <ns4:SignatureName>
                            <ns2:PersonFullName>PERSON1_FIRST_NAME PERSON1_LAST_NAME</ns2:PersonFullName>
                        </ns4:SignatureName>
                        <ns4:SignatureDate>
                            <ns2:Date>CURRENT_DATE_YYYY-MM-DD</ns2:Date>
                        </ns4:SignatureDate>
                    </ns5:Signature>
                    <ns5:SSFAttestation>
                        <ns5:SSFAttestationCollectionsAgreementIndicator>false</ns5:SSFAttestationCollectionsAgreementIndicator>
                        <ns5:SSFAttestationMedicaidObligationsIndicator>false</ns5:SSFAttestationMedicaidObligationsIndicator>
                        <ns5:SSFAttestationNonPerjuryIndicator>true</ns5:SSFAttestationNonPerjuryIndicator>
                        <ns5:SSFAttestationNotIncarceratedIndicator>true</ns5:SSFAttestationNotIncarceratedIndicator>
                        <ns5:SSFAttestationPrivacyAgreementIndicator>true</ns5:SSFAttestationPrivacyAgreementIndicator>
                        <ns5:SSFAttestationPendingChargesIndicator>true</ns5:SSFAttestationPendingChargesIndicator>
                        <ns5:SSFAttestationInformationChangesIndicator>true</ns5:SSFAttestationInformationChangesIndicator>
                    </ns5:SSFAttestation>
                </ns5:SSFSigner>
                <ns5:InsuranceApplicationRequestingMedicaidIndicator>true</ns5:InsuranceApplicationRequestingMedicaidIndicator>
                <ns5:SSFPrimaryContact>
                    <ns4:RoleOfPersonReference ns1:ref="M1"/>
                    <ns5:SSFPrimaryContactPreferenceCode>Email</ns5:SSFPrimaryContactPreferenceCode>
                </ns5:SSFPrimaryContact>
                <ns5:InsuranceApplicationTaxReturnAccessIndicator>true</ns5:InsuranceApplicationTaxReturnAccessIndicator>
            </ns5:InsuranceApplication>
            <ns4:Person ns1:id="M1">
                <ns2:PersonBirthDate>
                    <ns2:Date>PERSON1_BIRTH_DATE</ns2:Date>
                </ns2:PersonBirthDate>
                <ns2:PersonLivingIndicator>true</ns2:PersonLivingIndicator>
                <ns2:PersonName>
                    <ns2:PersonGivenName>PERSON1_FIRST_NAME</ns2:PersonGivenName>
                    <ns2:PersonSurName>PERSON1_LAST_NAME</ns2:PersonSurName>
                </ns2:PersonName>
                <ns2:PersonRaceText>PERSON1_RACE</ns2:PersonRaceText>
                <ns2:PersonSexText>PERSON1_GENDER</ns2:PersonSexText>
                <ns2:PersonSSNIdentification>
                    <ns2:IdentificationID>PERSON1_SSN</ns2:IdentificationID>
                </ns2:PersonSSNIdentification>
                <ns2:PersonUSCitizenIndicator>PERSON1_CITIZENSHIP_INDICATOR</ns2:PersonUSCitizenIndicator>
                <ns4:TribalAugmentation>
                    <ns4:PersonAmericanIndianOrAlaskaNativeIndicator>PERSON1_AIAN_INDICATOR</ns4:PersonAmericanIndianOrAlaskaNativeIndicator>
                </ns4:TribalAugmentation>
                <ns4:PersonAugmentation>
                    <ns4:PersonContactInformationAssociation>
                        <ns2:ContactInformationIsPrimaryIndicator>false</ns2:ContactInformationIsPrimaryIndicator>
                        <ns4:ContactInformation>
                            <ns2:ContactMailingAddress>
                                <ns2:StructuredAddress>
                                    <ns2:LocationStreet>
                                        <ns2:StreetFullText>ADDRESS_LINE_1</ns2:StreetFullText>
                                    </ns2:LocationStreet>
                                    <ns2:LocationCityName>CITY_NAME</ns2:LocationCityName>
                                    <ns2:LocationCountyCode>COUNTY_CODE</ns2:LocationCountyCode>
                                    <ns2:LocationStateUSPostalServiceCode>STATE_CODE</ns2:LocationStateUSPostalServiceCode>
                                    <ns2:LocationPostalCode>ZIP_CODE</ns2:LocationPostalCode>
                                </ns2:StructuredAddress>
                            </ns2:ContactMailingAddress>
                        </ns4:ContactInformation>
                        <ns4:ContactInformationCategoryCode>Home</ns4:ContactInformationCategoryCode>
                    </ns4:PersonContactInformationAssociation>
                    <ns4:PersonContactInformationAssociation>
                        <ns2:ContactInformationIsPrimaryIndicator>false</ns2:ContactInformationIsPrimaryIndicator>
                        <ns4:ContactInformation>
                            <ns2:ContactMailingAddress>
                                <ns2:StructuredAddress>
                                    <ns2:LocationStreet>
                                        <ns2:StreetFullText>ADDRESS_LINE_1</ns2:StreetFullText>
                                    </ns2:LocationStreet>
                                        <ns2:LocationCityName>CITY_NAME</ns2:LocationCityName>
                                        <ns2:LocationCountyCode>COUNTY_CODE</ns2:LocationCountyCode>
                                        <ns2:LocationStateUSPostalServiceCode>STATE_CODE</ns2:LocationStateUSPostalServiceCode>
                                    <ns2:LocationPostalCode>ZIP_CODE</ns2:LocationPostalCode>
                                </ns2:StructuredAddress>
                            </ns2:ContactMailingAddress>
                        </ns4:ContactInformation>
                        <ns4:ContactInformationCategoryCode>Mailing</ns4:ContactInformationCategoryCode>
                    </ns4:PersonContactInformationAssociation>
                    <ns4:PersonContactInformationAssociation>
                        <ns2:ContactInformationIsPrimaryIndicator>true</ns2:ContactInformationIsPrimaryIndicator>
                        <ns4:ContactInformation>
                            <ns2:ContactTelephoneNumber>
                                <ns2:FullTelephoneNumber>
                                    <ns2:TelephoneNumberFullID>PHONE_NUMBER_VAR</ns2:TelephoneNumberFullID>
                                </ns2:FullTelephoneNumber>
                            </ns2:ContactTelephoneNumber>
                        </ns4:ContactInformation>
                        <ns4:ContactInformationCategoryCode>Mobile</ns4:ContactInformationCategoryCode>
                    </ns4:PersonContactInformationAssociation>
                    <ns4:PersonContactInformationAssociation>
                        <ns2:ContactInformationIsPrimaryIndicator>false</ns2:ContactInformationIsPrimaryIndicator>
                        <ns4:ContactInformation>
                            <ns2:ContactTelephoneNumber>
                                <ns2:FullTelephoneNumber>
                                    <ns2:TelephoneNumberFullID>PHONE_NUMBER_VAR</ns2:TelephoneNumberFullID>
                                </ns2:FullTelephoneNumber>
                            </ns2:ContactTelephoneNumber>
                        </ns4:ContactInformation>
                        <ns4:ContactInformationCategoryCode>Home</ns4:ContactInformationCategoryCode>
                    </ns4:PersonContactInformationAssociation>
                    <ns4:PersonContactInformationAssociation>
                        <ns2:ContactInformationIsPrimaryIndicator>false</ns2:ContactInformationIsPrimaryIndicator>
                        <ns4:ContactInformation>
                            <ns2:ContactEmailID>PERSON1_EMAIL</ns2:ContactEmailID>
                        </ns4:ContactInformation>
                        <ns4:ContactInformationCategoryCode>Email</ns4:ContactInformationCategoryCode>
                    </ns4:PersonContactInformationAssociation>
                    <ns4:PersonPregnancyStatus>
                        <ns4:StatusValidDateRange>
                            <ns2:EndDate>
                                <ns2:Date>CURRENT_DATE_YYYY-MM-DD</ns2:Date>
                            </ns2:EndDate>
                        </ns4:StatusValidDateRange>
                        <ns4:StatusIndicator>false</ns4:StatusIndicator>
                        <ns4:PregnancyStatusExpectedBabyQuantity>0</ns4:PregnancyStatusExpectedBabyQuantity>
                    </ns4:PersonPregnancyStatus>
                    <ns4:PersonMedicaidIdentification xsi:nil="true"/>
                    <ns4:PersonIncome>
                        <ns4:IncomeFrequency>
                            <ns4:FrequencyCode>PERSON1_INCOME_FREQUENCY_CODE</ns4:FrequencyCode>
                        </ns4:IncomeFrequency>
                        <ns4:IncomeAmount>PERSON1_INCOME_AMOUNT</ns4:IncomeAmount>
                        <ns4:IncomeCategoryCode>Wages</ns4:IncomeCategoryCode>
                    </ns4:PersonIncome>
                    <ns4:PersonPreferredLanguage>
                        <ns2:LanguageName>English</ns2:LanguageName>
                        <ns2:PersonSpeaksLanguageIndicator>true</ns2:PersonSpeaksLanguageIndicator>
                        <ns2:PersonWritesLanguageIndicator>true</ns2:PersonWritesLanguageIndicator>
                    </ns4:PersonPreferredLanguage>
                    <ns4:PersonMarriedIndicator>false</ns4:PersonMarriedIndicator>
                </ns4:PersonAugmentation>
            </ns4:Person>
            <ns3:PhysicalHousehold>
                <ns5:HouseholdMemberReference ns1:ref="M1"/>
            </ns3:PhysicalHousehold>
        </ns9:AccountTransferRequest>
    </soap:Body>
</soap:Envelope>